In [1]:
import pandas as pd

In [31]:
import numpy as np

In [32]:
date=pd.read_csv("orders.csv")

In [33]:

time=pd.read_csv("messages.csv")

# DATE and TIME

In [34]:
date

           date  product_id  city_id  orders
0    2019-12-10        5628       25       3
1    2018-08-15        3646       14     157
2    2018-10-23        1859       25       1
3    2019-08-17        7292       25       1
4    2019-01-06        4344       25       3
..          ...         ...      ...     ...
995  2018-10-08         255       13       1
996  2018-12-06        5521        7       1
997  2019-05-07         487       26      14
998  2019-03-03        1503       21       2
999  2019-10-15        6371        7      22

[1000 rows x 4 columns]

In [36]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   object
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: int64(3), object(1)
memory usage: 31.4+ KB

##  Working with date

we can se that our date is an object first lets convert it into date time

In [104]:
date['date']=pd.to_datetime(date['date'])
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 13 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   date             1000 non-null   datetime64[ns]
 1   product_id       1000 non-null   int64
 2   city_id          1000 non-null   int64
 3   orders           1000 non-null   int64
 4   date_year        1000 non-null   int64
 5   date_month       1000 non-null   int64
 6   month_name       1000 non-null   object
 7   date_day         1000 non-null   int64
 8   date_dow_name    1000 non-null   object
 9   date_is_weekend  1000 non-null   int32
 10  date_week        1000 non-null   int64
 11  quarter          1000 non-null   int64
 12  semester         1000 non-null   int32
dtypes: datetime64[ns](1), int32(2), int64(8), object(2)
memory usage: 93.9+ KB

### 1. Extract year

In [105]:
date['date']

0     2019-12-10
1     2018-08-15
2     2018-10-23
3     2019-08-17
4     2019-01-06
         ...
995   2018-10-08
996   2018-12-06
997   2019-05-07
998   2019-03-03
999   2019-10-15
Name: date, Length: 1000, dtype: datetime64[ns]

we have to extract year from this

In [106]:
date['date_year']=date['date'].dt.year
date['date_year']

0      2019
1      2018
2      2018
3      2019
4      2019
       ...
995    2018
996    2018
997    2019
998    2019
999    2019
Name: date_year, Length: 1000, dtype: int64

### 2. Extract Month

In [45]:
date['date_month']=date['date'].dt.month

In [46]:
date['date_month']

0      12
1       8
2      10
3       8
4       1
       ..
995    10
996    12
997     5
998     3
999    10
Name: date_month, Length: 1000, dtype: int64

#### month name

In [51]:
date['month_name']=date['date'].dt.month_name()
date['month_name']
date.sample(4)

          date  product_id  city_id  orders  date_year  date_month month_name
726 2019-10-20        5794        6       1       2019          10    October
271 2019-10-20        5281       18       1       2019          10    October
926 2019-07-07        6640       26      48       2019           7       July
665 2018-09-29         146       16       5       2018           9  September

### 3. Extract Days

In [107]:
date['date_day']=date['date'].dt.day

In [108]:
date['date_day']

0      10
1      15
2      23
3      17
4       6
       ..
995     8
996     6
997     7
998     3
999    15
Name: date_day, Length: 1000, dtype: int64

#### day of week

In [62]:
date['date'].dt.dayofweek

0      1
1      2
2      1
3      5
4      6
      ..
995    0
996    3
997    1
998    6
999    1
Name: date, Length: 1000, dtype: int64

#### day of week name

In [67]:
date['date_dow_name']=date['date'].dt.day_name()
date['date_dow_name']
date.drop(columns=['product_id','city_id','orders']).head()

        date  date_year  date_month month_name  date_day date_dow_name
0 2019-12-10       2019          12   December        10       Tuesday
1 2018-08-15       2018           8     August        15     Wednesday
2 2018-10-23       2018          10    October        23       Tuesday
3 2019-08-17       2019           8     August        17      Saturday
4 2019-01-06       2019           1    January         6        Sunday

#### is weekend ?

In [69]:
date['date_is_weekend']=np.where(date['date_dow_name'].isin(['Sunday','Saturday']),1,0)

In [70]:
date['date_is_weekend']

0      0
1      0
2      0
3      1
4      1
      ..
995    0
996    0
997    0
998    1
999    0
Name: date_is_weekend, Length: 1000, dtype: int32


### 4. Extract week of the year

In [109]:
date['date_week']=date['date'].dt.week
date['date_week']

C:\Users\rani\AppData\Local\Temp\ipykernel_18056\217776318.py:1: FutureWarning: Series.dt.weekofyear and Series.dt.week have been deprecated.  Please use Series.dt.isocalendar().week instead.
  date['date_week']=date['date'].dt.week

0      50
1      33
2      43
3      33
4       1
       ..
995    41
996    49
997    19
998     9
999    42
Name: date_week, Length: 1000, dtype: int64

### 5. Extract Quarteer

In [75]:
date['quarter']=date['date'].dt.quarter

In [110]:
date['quarter']

0      4
1      3
2      4
3      3
4      1
      ..
995    4
996    4
997    2
998    1
999    4
Name: quarter, Length: 1000, dtype: int64

### 6. Extract Semester

In [111]:
date['semester']=np.where(date['quarter'].isin([1,2]),1,2)

In [112]:
date['semester']

0      2
1      2
2      2
3      2
4      1
      ..
995    2
996    2
997    1
998    1
999    2
Name: semester, Length: 1000, dtype: int32

### 7. Extract Time Elapsed Between dates

In [113]:
import datetime

In [115]:
today=datetime.datetime.today()
today

datetime.datetime(2022, 6, 30, 8, 44, 20, 25515)

In [116]:
today-date['date']

0      933 days 08:44:20.025515
1     1415 days 08:44:20.025515
2     1346 days 08:44:20.025515
3     1048 days 08:44:20.025515
4     1271 days 08:44:20.025515
                 ...
995   1361 days 08:44:20.025515
996   1302 days 08:44:20.025515
997   1150 days 08:44:20.025515
998   1215 days 08:44:20.025515
999    989 days 08:44:20.025515
Name: date, Length: 1000, dtype: timedelta64[ns]

In [117]:
(today-date['date']).dt.days

0       933
1      1415
2      1346
3      1048
4      1271
       ...
995    1361
996    1302
997    1150
998    1215
999     989
Name: date, Length: 1000, dtype: int64

#### months passed

In [86]:
np.round((today-date['date'])/np.timedelta64(1,'M'),0)

0      31.0
1      47.0
2      44.0
3      34.0
4      42.0
       ...
995    45.0
996    43.0
997    38.0
998    40.0
999    33.0
Name: date, Length: 1000, dtype: float64

In [118]:
## Working with time

In [119]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   datetime64[ns]
 1   msg     1000 non-null   object
 2   hour    1000 non-null   int64
dtypes: datetime64[ns](1), int64(1), object(1)
memory usage: 23.6+ KB

In [120]:
time.sample(4)

,date,msg,hour
449,2013-03-18 00:39:00,к. яна я тебя люблю! ты самая лутшая!=*,0
330,2015-09-15 00:01:00,Парень ищет сейчас пышную жен для и/о 067 269 24,0
933,2014-06-02 00:36:00,Нужна ж 097-57-55-794,0
629,2014-09-05 00:24:00,замужняя устала от быта хочу любви и романтики...,0

In [121]:
time['date']=pd.to_datetime(time['date'])

In [122]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   datetime64[ns]
 1   msg     1000 non-null   object
 2   hour    1000 non-null   int64
dtypes: datetime64[ns](1), int64(1), object(1)
memory usage: 23.6+ KB

In [123]:
time['hour']=time['date'].dt.hour

In [124]:
time['date'].dt.minute

0      50
1      40
2      21
3      31
4      11
       ..
995    50
996    14
997    37
998    34
999    25
Name: date, Length: 1000, dtype: int64

In [125]:
time['date'].dt.second

0      0
1      0
2      0
3      0
4      0
      ..
995    0
996    0
997    0
998    0
999    0
Name: date, Length: 1000, dtype: int64

In [126]:
time['date'].dt.time

0      00:50:00
1      23:40:00
2      00:21:00
3      00:31:00
4      23:11:00
         ...
995    00:50:00
996    23:14:00
997    23:37:00
998    23:34:00
999    23:25:00
Name: date, Length: 1000, dtype: object

In [127]:
today-time['date']

0     3119 days 07:54:20.025515
1     2983 days 09:04:20.025515
2     3469 days 08:23:20.025515
3     2771 days 08:13:20.025515
4     3168 days 09:33:20.025515
                 ...
995   3758 days 07:54:20.025515
996   3079 days 09:30:20.025515
997   3544 days 09:07:20.025515
998   3660 days 09:10:20.025515
999   2932 days 09:19:20.025515
Name: date, Length: 1000, dtype: timedelta64[ns]

In [101]:
(today - time['date'])/np.timedelta64(1,'s')

0      2.695095e+08
1      2.577633e+08
2      2.997513e+08
3      2.394435e+08
4      2.737491e+08
           ...
995    3.247191e+08
996    2.660593e+08
997    3.062339e+08
998    3.162565e+08
999    2.533578e+08
Name: date, Length: 1000, dtype: float64

In [102]:
(today - time['date'])/np.timedelta64(1,'m')

0      4.491825e+06
1      4.296055e+06
2      4.995854e+06
3      3.990724e+06
4      4.562484e+06
           ...
995    5.411985e+06
996    4.434321e+06
997    5.103898e+06
998    5.270941e+06
999    4.222630e+06
Name: date, Length: 1000, dtype: float64

In [103]:

# in hours

(today - time['date'])/np.timedelta64(1,'h')

0      74863.754858
1      71600.921524
2      83264.238191
3      66512.071524
4      76041.404858
           ...
995    90199.754858
996    73905.354858
997    85064.971524
998    87849.021524
999    70377.171524
Name: date, Length: 1000, dtype: float64